In [1]:
import pandas as pd

In [12]:
df = pd.read_csv('placement.csv')

In [25]:
df.head()

   cgpa  placement_exam_marks  placed
0  7.19                  26.0       1
1  7.46                  38.0       1
2  7.54                  40.0       1
3  6.42                   8.0       1
4  7.23                  17.0       0

In [31]:
df.head(2)

   cgpa  placement_exam_marks  placed
0  7.19                  26.0       1
1  7.46                  38.0       1

In [30]:
df.head(10)

   cgpa  placement_exam_marks  placed
0  7.19                  26.0       1
1  7.46                  38.0       1
2  7.54                  40.0       1
3  6.42                   8.0       1
4  7.23                  17.0       0
5  7.30                  23.0       1
6  6.69                  11.0       0
7  7.12                  39.0       1
8  6.45                  38.0       0
9  7.75                  94.0       1

In [14]:
df.tail()    
df.tail(3)

     cgpa  placement_exam_marks  placed
997  4.89                  34.0       0
998  8.62                  46.0       1
999  4.90                  10.0       1

In [15]:
df.columns

Index(['cgpa', 'placement_exam_marks', 'placed'], dtype='object')

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   cgpa                  1000 non-null   float64
 1   placement_exam_marks  1000 non-null   float64
 2   placed                1000 non-null   int64
dtypes: float64(2), int64(1)
memory usage: 23.6 KB

In [17]:
df.describe()

              cgpa  placement_exam_marks       placed
count  1000.000000           1000.000000  1000.000000
mean      6.961240             32.225000     0.489000
std       0.615898             19.130822     0.500129
min       4.890000              0.000000     0.000000
25%       6.550000             17.000000     0.000000
50%       6.960000             28.000000     0.000000
75%       7.370000             44.000000     1.000000
max       9.120000            100.000000     1.000000

In [18]:
df.isnull().sum()

cgpa                    0
placement_exam_marks    0
placed                  0
dtype: int64

In [22]:
df.dropna(inplace=True)